YuSungyeon/Wifi_esp32/esp32s3_csi_sink/sdkconfig.defaults
# esp-csi csi_recv 예제 기반. ESP-IDF v5.2.2 + ESP32-S3 타겟.
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_PARTITION_TABLE_OFFSET=0xa000
CONFIG_ESP_CONSOLE_UART_CUSTOM=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=921600
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
# 싱크는 RX 업링크 N개 + TX broadcast 를 동시에 받는다 (2-RX 에서 ~300 pkt/s).
# 기본 static 10 / dynamic 128 에서 싱크에서 먼 RX 가 ~7% 를 잃었다 (troubleshooting/08).
# IDF v5.2.2 ESP32-S3 Kconfig 범위: static [2,25], dynamic [0,128] — 범위 밖 값은 조용히
# 기본값으로 떨어진다 (256 을 넣었더니 dynamic 이 32 로 리셋됐다). static 만 여유가 있다.
# 결과: static 25 로 올려도 손실 그대로(RX102 7.6%) — 버퍼 수는 원인이 아니다. 해는 없어
# 최대값으로 둔다.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=25
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=128
CONFIG_ESP_WIFI_CSI_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=n
